#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:nil e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:nil todo:t |:t
#+TITLE: Notes On [[https://www.adamtornhill.com/articles/lispweb.htm][Lisp for the Web]]
#+DATE: <2020-04-23 qui>
#+AUTHOR: Gustavo Alves Pacheco
#+EMAIL: gap1512@gmail.com
#+LANGUAGE: pt-BR
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.3 (Org mode 9.1.9)

** Representando jogos como objetos

Para representar um jogo, o qual será avaliado pelo usuário do site,
optou-se por utilizar o sistema de objetos do Lisp.

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (defclass game ()
      ((name :reader name
	     :initarg :name)
       (votes :accessor votes
	      :initform 0)))
#+END_SRC

Desta forma, um jogo é composto por dois atributos: Name e Votes. Para instanciar
um objeto dessa classe, utiliza-se a função:

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (defvar many-lost-hours (make-instance 'game :name "Tetris"))
#+END_SRC

#+RESULTS:
: MANY-LOST-HOURS

Os acessores dos atributos são definidos intrinsicamente pela linguagem,
ao utilizar reader para leitura e accessor para leitura e escrita.

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (votes many-lost-hours)
#+END_SRC

#+RESULTS:
: 0

Definindo um método que acessa o atributo de determinado objeto e incrementa 
o número de votos é simples:

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (defmethod vote-for (user-selected-game)
    (incf (votes user-selected-game)))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD RETRO-GAMES::VOTE-FOR (T) {262CC8D9}>

** Customizando a representação de impressão de objetos

É possível definir uma forma de impressão para os objetos da classe,
especializando a função genérica print-object da classe game, da forma:

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (defmethod print-object ((object game) stream)
    (print-unreadable-object (object stream :type t)
      (with-slots (name votes) object
	(format stream "name: ~s with ~d votes" name votes))))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD COMMON-LISP:PRINT-OBJECT (GAME T) {251DFFD9}>

Print-unreadable-object recebe um objeto, uma stream e alguns parâmetros adicionais,
além de um corpo. Tal função imprime o corpo dentro de ``#<" e ``>". Caso type
seja true, adiciona a classe do objeto ao começo da frase.
With-slots evita que o objeto seja acessado duas vezes, para buscar cada atributo. 

** Generating HTML dynamically

Primeiramente, quando deseja-se criar uma linguagem embutida a um domínio 
específico, procura-se uma representação de tal linguagem em Lisp. Para HTML,
pode-se utilizar o pacote CL-WHO.

#+HEADER: :exports both
#+BEGIN_SRC lisp
  (setf (html-mode) :html5)

  (with-html-output (*standard-output* nil :indent t :prologue t)
    (:html
     (:head
      (:title "Test page"))
     (:body
      (:p "CL-WHO é fácil de usar"))))
#+END_SRC

#+RESULTS:
#+begin_example html
<!DOCTYPE html>

<html>
  <head>
    <title>Test page
    </title>
  </head>
  <body>
    <p>CL-WHO é fácil de usar
    </p>
  </body>
</html>
#+end_example

O primeiro comando especifica a utilização do HTML5. Além disso, para que o
Doctype apareça no documento, requisita-se o prologue. Outra vantagem do 
CL-WHO é que o mesmo permite que expressões Lisp sejam avaliadas no corpo, possibilitando
a criação de páginas dinâmicas.

** Pushing work to the server-side

O sistema desenvolvido se encontra em estágios iniciais de desenvolvimento, sendo
possível imaginar diversas adições ao sistema. Uma delas é a categorização dos jogos.
Estender :retro-games para abranger categorias é trivial:

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (defclass game ()
    ((name :reader name
	   :initarg :name)
     (votes :accessor votes
	    :initarg :votes
	    :initform 0)
     (category :accessor category
	       :initarg :category)))
#+END_SRC

#+RESULTS:
: #<STANDARD-CLASS RETRO-GAMES::GAME>

A extensão do backend também é similar: 

#+HEADER: :exports code
#+BEGIN_SRC lisp
  (defun game->doc (game)
    (with-slots (name votes category) game
      ($ ($ "name" name)
	 ($ "votes" votes)
	 ($ "category" category))))

  (defun add-game (name category)
    (let ((game (make-instance 'game :name name :category category)))
      (db.insert *game-collection* (game->doc game))))
#+END_SRC

#+RESULTS:
: ADD-GAME

O código acima é suficiente para adicionar o recurso de categorias, de forma
persistente. Um novo recurso passa a ser interessante: exibir quantos jogos por
categoria. Tal funcionalidade permitiria a visualização do crescimento das categorias.
Para isso,  tal recurso poderia ser implementado na função games. Nela, os jogos
seriam recuperados, agrupados por categoria, e enfim somados os números de jogos
em cada categorias. É ineficiente. Melhor deixar para o banco. Para isso, um algoritmo
de MapReduce é o recomendado.

